HELYXcore-4.4.0/examples/legacy/heatTransfer/chtMultiRegionFoam/multiRegionHeater/system/leftSolid/materialProperties
/*--------------------------------*- C++ -*----------------------------------*\
|       o        |                                                            |
|    o     o     |  HELYX (R) : Open-source CFD for Enterprise                |
|   o   O   o    |  Version : 4.4.0                                           |
|    o     o     |  ENGYS Ltd. <http://engys.com/>                            |
|       o        |                                                            |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      materialProperties;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

materialType     solid;
kappaModel       constSolid;
thermodynamics   hConst;
equationOfState  rhoConst;
energy           sensibleEnthalpy;
molWeight        50;

kappaModelCoeffs
{
    kappa   80;
}

thermodynamicsCoeffs
{
    Hf      0;
    Cp      450;
}

equationOfStateCoeffs
{
    rho     8000;
}

// ************************************************************************* //
